Link to dataset: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

In [7]:
# import libraries

import numpy as np
import pandas as pd

In [8]:
#  read in .tsv file as .csv

df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep = '\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### 1. Which was the most-ordered item?

In [9]:
df.groupby('item_name').size().sort_values(ascending=False).head().reset_index()

             item_name    0
0         Chicken Bowl  726
1      Chicken Burrito  553
2  Chips and Guacamole  479
3        Steak Burrito  368
4    Canned Soft Drink  301

### 2. For the most-ordered item, how many items were ordered?

In [10]:
df.groupby('item_name')['quantity'].size().sort_values(ascending = False).head(1).reset_index()

      item_name  quantity
0  Chicken Bowl       726

### 3. What was the most ordered item in the choice_description column?

In [11]:
df.groupby('choice_description')['quantity'].size().sort_values(ascending = False).reset_index().head()

                                  choice_description  quantity
0                                        [Diet Coke]       134
1                                             [Coke]       123
2                                           [Sprite]        77
3  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...        42
4  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...        40

### 4. How many items were ordered in total?

In [12]:
df['quantity'].sum()

4972

### 5. Turn the item price into a float.

In [13]:
# check the dtype of dataset, item_price is object type

df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [14]:
# strip dollar sign
df['item_price'] = df['item_price'].apply(lambda x:x.strip('$'))


# convert to float 
df['item_price'] = df['item_price'].astype(float)

In [15]:
# item_price no longer  have dollar sign
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [16]:
# view data types again, item price now shows as a float
df.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

### 6. How much was the revenue for the period in the dataset?

In [17]:
revenue = df['item_price'].sum()
revenue

34500.16

### 7. How many orders were made in the period?

In [18]:
total_orders = df['order_id'].count()
total_orders

4622

### 8. What is the average revenue amount per order?

In [19]:
revenue/total_orders

7.464335785374297

### 9. How many different items are sold?

In [20]:
df['item_name'].nunique()

50

### 10. How many products cost more than $10.00?

In [35]:
df[df['item_price'] > 10.00]

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
23,12,1,Chicken Burrito,"[[Tomatillo-Green Chili Salsa (Medium), Tomati...",10.98
...,...,...,...,...,...
4610,1830,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4611,1830,1,Veggie Burrito,"[Tomatillo Green Chili Salsa, [Rice, Fajita Ve...",11.25
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25

### 11. What is the price of each item?

In [60]:
df_filtered = df.drop_duplicates(['item_name','quantity'])

df_one_prod = df_filtered[df_filtered.quantity == 1]

price_per_item = df_one_prod[['item_name', 'item_price']]

price_per_item.sort_values(by = "item_price", ascending = False).head(20)

                  item_name  item_price
606        Steak Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
7             Steak Burrito       11.75
168   Barbacoa Crispy Tacos       11.75
39            Barbacoa Bowl       11.75
738       Veggie Soft Tacos       11.25
186       Veggie Salad Bowl       11.25
62              Veggie Bowl       11.25
57           Veggie Burrito       11.25
250           Chicken Salad       10.98
5              Chicken Bowl       10.98
8          Steak Soft Tacos        9.25
554   Carnitas Crispy Tacos        9.25
237     Carnitas Soft Tacos        9.25
56      Barbacoa Soft Tacos        9.25
92       Steak Crispy Tacos        9.25
664             Steak Salad        8.99
54               Steak Bowl        8.99
3750         Carnitas Salad        8.99

### 12. Sort by the name of the item

In [63]:
df['item_name'].sort_values().reset_index()

      index          item_name
0      3389  6 Pack Soft Drink
1       341  6 Pack Soft Drink
2      1849  6 Pack Soft Drink
3      1860  6 Pack Soft Drink
4      2713  6 Pack Soft Drink
...     ...                ...
4617   2384  Veggie Soft Tacos
4618    781  Veggie Soft Tacos
4619   2851  Veggie Soft Tacos
4620   1699  Veggie Soft Tacos
4621   1395  Veggie Soft Tacos

[4622 rows x 2 columns]

### 13. What was the quantity of the most expensive item ordered?

In [74]:
df.sort_values(by = 'item_price', ascending = False).head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

### 14. How many times was a Veggie Salad Bowl ordered?

In [77]:
(df['item_name'] == 'Veggie Salad Bowl').sum()

18

### 15. How many times did someone order more than one Canned Soda?

In [89]:
can_soda = df[(df['item_name'] == 'Canned Soda') & (df['quantity'] > 1)]
len(can_soda)

20